gstroe/Harmony/gfx/lcc/firmware/src/system_config/pic32mz_ef_sk_meb2/framework/driver/gfx/controller/lcc/drv_gfx_lcc_generic.c
    }
    return;
}

// *****************************************************************************
/*
  Function:
     void DRV_GFX_LCC_MaxXGet()

  Summary:
     Returns x extent of the display.

  Description:

  Precondition:

  Parameters:

  Returns:

  Example:
    <code>
    <code>

  Remarks:
*/
uint16_t DRV_GFX_LCC_MaxXGet()
{
    return drvLCCObj.maxX;
}

// *****************************************************************************
/*
  Function:
     void DRV_GFX_LCC_MaxYGet()

  Summary:
     Returns y extent of the display.

  Description:

  Precondition:

  Parameters:

  Returns:

  Example:
    <code>
    <code>

  Remarks:
*/
uint16_t DRV_GFX_LCC_MaxYGet()
{
    return drvLCCObj.maxY;
}

/*********************************************************************
  Function:
     void DRV_GFX_LCC_InterfaceSet( DRV_HANDLE handle, DRV_GFX_INTERFACE * interface )

  Summary:
    Returns the API of the graphics controller

  Description:
    none

  Return:

  *********************************************************************/
void DRV_GFX_LCC_InterfaceSet( DRV_HANDLE handle, DRV_GFX_INTERFACE * interface )
{
    interface->BarFill = DRV_GFX_LCC_BarFill;
    interface->PixelArrayPut = DRV_GFX_LCC_PixelArrayPut;
    interface->PixelArrayGet = DRV_GFX_LCC_PixelArrayGet;
    interface->PixelPut = DRV_GFX_LCC_PixelPut;
    interface->ColorSet = DRV_GFX_LCC_SetColor;
    interface->PageSet = DRV_GFX_LCC_SetPage;
    interface->Layer = DRV_GFX_LCC_Layer;
    interface->MaxXGet = DRV_GFX_LCC_MaxXGet;
    interface->MaxYGet = DRV_GFX_LCC_MaxYGet;
}

uint16_t DRV_GFX_LCC_SetPage(uint8_t pageType, uint8_t page)
{
    switch(pageType)
    {
        case ACTIVE_PAGE:
            drvLCCObj.initData->activePage = page;
            if ( drvLCCObj.initData->activePage == 0 )
                _ebiBaseAddress = (uint16_t*)SRAM_ADDR_CS0;
            else
                _ebiBaseAddress = (uint16_t*)SRAM_ADDR_CS1;
            break;
        case VISUAL_PAGE:
            drvLCCObj.initData->visualPage = page;
            ADDR17 = page;
            ADDR18 = page>>1;
            break;
        }
        return(0);
}
// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_SetColor(uint8_t instance, GFX_COLOR color)

  Summary: Sets the color for the driver instance

  Description:

  Output: none

*/

void DRV_GFX_LCC_SetColor(GFX_COLOR color)
{
  drvLCCObj.initData->color = color;
}

// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_DisplayRefresh(void)

  Summary: State Machine driving H-Sync, V-Sync and DE timing

  Description:

  Output: none

*/

void DRV_GFX_LCC_DisplayRefresh(void)
{
    static uint16_t remainingPixels=0;
    static uint8_t prevGraphicsState = BLANKING_PERIOD;
    static uint16_t pipLine = 0;
    static uint32_t pixelAddress=0;
    static uint8_t GraphicsState = ACTIVE_PERIOD;
    static uint16_t remaining = 0;
    static short line = 0;
    DrawCount = 0;

    switch(GraphicsState)
    {
        case ACTIVE_PERIOD:
            remaining = DISP_HOR_RESOLUTION;
            GraphicsState = BLANKING_PERIOD;

            if(line >= 0)
            {
			PMADDR = ((PMP_ADDRESS_LINES) & ((line) * DISP_HOR_RESOLUTION));

			if((line) == (DISP_VER_RESOLUTION))
			{
				// notify registered callback that the display is in vsync mode
				if(drvLCCObj.vsync_cb != NULL)
					drvLCCObj.vsync_cb();

				VSYNC = 0;
				line = (-VER_BLANK);
                ADDR16 = 0;
				overflowcount = 0;
				pipLine = 0;
			}
			else
			{
				DATA_ENABLE = 1;
				if((line >= PipStartT)&&(line <= (PipStartT + PipVLength))&&(PipVLength != 0))
				{
					overflowcount = ((line) * DISP_HOR_RESOLUTION)/PMADDR_OVERFLOW;
					GraphicsState = PIP;

					if(!PipStartL)
					{
						//Draw PIP Line
			case PIP:
					ADDR17 = GFXPIPPage;
			        ADDR18 = GFXPIPPage>>1;
					pixelAddress = (uint32_t)(((PipY+pipLine++)*(DISP_HOR_RESOLUTION))+(PipX));

					PMADDR = pixelAddress&(PMP_ADDRESS_LINES);

					overflowcount = pixelAddress/PMADDR_OVERFLOW;
					remaining = PipHLength;

					remainingPixels = DISP_HOR_RESOLUTION - remaining - PipStartL;
					pixelAddress = ((line*DISP_HOR_RESOLUTION) + remaining + PipStartL);

					GraphicsState = FINISH_LINE;
				}
				else
				{
					remaining = PipStartL;
				}

				    ADDR16 = overflowcount;
				}

				if(scroll > 0)
				{

					switch(scroll)
					{
						case 1:             //Up
						case 2:             //Down
							if(line < scrollLine)
							{
								pixelAddress = ((drvLCCObj.initData->verticalResolution-1)-(scrollLine-line)) * DISP_HOR_RESOLUTION;
						        ADDR17 = drvLCCObj.initData->visualPage;
						        ADDR18 = drvLCCObj.initData->visualPage>>1;
							}
							else
							{
								pixelAddress = (line-scrollLine) * DISP_HOR_RESOLUTION;
						        ADDR17 = scrollPage;
				                ADDR18 = scrollPage>>1;
							}

							PMADDR = (pixelAddress)&(PMP_ADDRESS_LINES);
							overflowcount = pixelAddress/PMADDR_OVERFLOW;
							break;

						case 3://Left
						case 4://Right
							pixelAddress = ((line+1) * DISP_HOR_RESOLUTION) + ((drvLCCObj.initData->horizontalResolution-1)-scrollLine);

							PMADDR = (pixelAddress)&(PMP_ADDRESS_LINES);
							overflowcount = pixelAddress/PMADDR_OVERFLOW;

							if(scroll == 3)
							{
					            ADDR17 = drvLCCObj.initData->visualPage;
				                ADDR18 = drvLCCObj.initData->visualPage>>1;
							}
							else
							{
								ADDR17 = scrollPage;
								ADDR18 = scrollPage>>1;
							}

							remaining = scrollLine;
							remainingPixels = DISP_HOR_RESOLUTION - scrollLine;
							pixelAddress = (line) * DISP_HOR_RESOLUTION;
							GraphicsState = FINISH_LINE;
							break;
						}

						if((scroll > 2) && (GraphicsState != FINISH_LINE))
						{
					case FINISH_LINE:            //Finish Line Render
						remaining = remainingPixels;

						PMADDR = (pixelAddress)&(PMP_ADDRESS_LINES);
						overflowcount = pixelAddress/PMADDR_OVERFLOW;

						if(scroll == 3)
						{
							ADDR17 = scrollPage;
							ADDR18 = scrollPage>>1;
						}
						else
						{
							ADDR17 = drvLCCObj.initData->visualPage;
							ADDR18 = drvLCCObj.initData->visualPage>>1;
						}

						GraphicsState = BLANKING_PERIOD;
					}
					ADDR16 = overflowcount;
				}

			    prevGraphicsState = GraphicsState;

				if((PMADDR_OVERFLOW - PMADDR) < (remaining))
				{
					GraphicsState = OVERFLOW;      //Do Overflow routine
					PLIB_DMA_ChannelXDestinationSizeSet(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, (uint16_t)(((PMADDR_OVERFLOW)- PMADDR)<<1));
					PLIB_DMA_ChannelXINTSourceFlagClear(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, DMA_INT_BLOCK_TRANSFER_COMPLETE);
					PLIB_DMA_ChannelXEnable(DMA_ID_0,DRV_GFX_LCC_DMA_CHANNEL_INDEX);
					remaining = remaining - ((PMADDR_OVERFLOW)- PMADDR);
					return;
				}
			}
		}
		break;

